In [1]:
import os

In [2]:
#!pip install mysql-connector

In [4]:
#!pip uninstall mysql-connector

In [5]:
#!pip install mysql-connector-python

In [6]:
import mysql.connector

In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [8]:
user_name=os.environ.get('DB_USER')
password=os.environ.get('DB_PASS')

In [9]:
connection=mysql.connector.connect(host='localhost', user="root",password="harinhk",database='imdb',auth_plugin='mysql_native_password')

In [10]:
connection

In [11]:
pd.read_sql_query("SHOW TABLES FROM imdb", connection)

     Tables_in_imdb
0            actors
1         directors
2  directors_genres
3            movies
4  movies_directors
5     movies_genres
6             roles

In [12]:
pd.read_sql_query("SELECT * FROM actors", connection)

            id     first_name           last_name gender
0            2        Michael  'babeepower' Viera      M
1            3           Eloy         'Chincheta'      M
2            4       Dieguito         'El Cigala'      M
3            5        Antonio    'El de Chipiona'      M
4            6           José        'El Francés'      M
...        ...            ...                 ...    ...
817713  845461         Herdís      Þorvaldsdóttir      F
817714  845462  Katla Margrét      Þorvaldsdóttir      F
817715  845463     Lilja Nótt      Þórarinsdóttir      F
817716  845464     Hólmfríður      Þórhallsdóttir      F
817717  845465       Theódóra        Þórðardóttir      F

[817718 rows x 4 columns]

In [13]:
pd.read_sql_query("SELECT @@VERSION", connection)

  @@VERSION
0    8.0.17

In [16]:
#pd.read_sql_query("SELECT @@SERVERNAME", connection)
#pd.read_sql_query("SELECT @@SERVICENAME", connection)

In [18]:
#pd.read_sql_query("SELECT serverproperty('ComputerNamePhysicalNetBIOS')", connection)

In [28]:
pd.read_sql_query("CREATE TABLE HelloWorld (Id INT NOT NULL AUTO_INCREMENT, tutorial_title VARCHAR(100) NOT NULL, tutorial_author VARCHAR(40) NOT NULL, submission_date DATE, PRIMARY KEY (Id))", connection)

TypeError: 'NoneType' object is not iterable

In [29]:
pd.read_sql_query("SELECT * FROM HelloWorld", connection)

Empty DataFrame
Columns: [Id, tutorial_title, tutorial_author, submission_date]
Index: []

In [24]:
pd.read_sql_query("DROP TABLE HelloWorld", connection)

TypeError: 'NoneType' object is not iterable

In [30]:
pd.read_sql_query("INSERT INTO HelloWorld (tutorial_title, tutorial_author, submission_date) VALUES (`Learn PHP`, `John Poul`, NOW())", connection)

DatabaseError: Execution failed on sql 'INSERT INTO HelloWorld (tutorial_title, tutorial_author, submission_date) VALUES (`Learn PHP`, `John Poul`, NOW())': 1054 (42S22): Unknown column 'Learn PHP' in 'field list'